<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
<!--
#
#  Copyright (c) 2015, Facebook, Inc.
#  All rights reserved.
#
#  This source code is licensed under the BSD-style license found in the
#  LICENSE file in the root directory of this source tree. An additional grant
#  of patent rights can be found in the PATENTS file in the same directory.
-->
    <key>Description</key>
    <string>Packages the latest version of LastPass Enterprise's Safari extension customized for Facebook.</string>
    <key>Identifier</key>
    <string>com.facebook.autopkg.pkg.lastpass.safari</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>LastPass</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.facebook.autopkg.download.lastpass</string>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <!-- Safari:
                Copy lastpass.safariextz to /Library/Safari/
                "Open -a Safari.app /Library/Safari/lastpass.safariextz" is necessary to install the file, 
                which can be done via LaunchAgent, Munki postinstall script, package postinstall script, etc.
        -->
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Safari</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0775</string>
                    <key>Library/Safari</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/LastPass/LastPass Installer.app/Contents/Resources/lastpass.safariextz</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/Safari</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>XARUnarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive</key>
                <string>%RECIPE_CACHE_DIR%/LastPass/LastPass Installer.app/Contents/Resources/lastpass.safariextz</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/lastpass.safariextension/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-Safari</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.facebook.pkg.lastpass.safari</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library/Safari</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>